ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_hsi2c.h
/**
 *******************************************************************************
 * @file  hsi2c.h
 * @brief This file contains all the functions prototypes of the HSI2C driver
 *        library
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-18       MADS            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

#ifndef __HSI2C_H__
#define __HSI2C_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l021_ddl.h"

/**
 * @addtogroup HC32L021_DDL 驱动库
 * @{
 */

/**
 * @addtogroup DDL_HSI2C HSI2C模块驱动库
 * @{
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup HSI2C_Global_Types HSI2C全局类型定义
 * @{
 */

/**
 * @brief HSI2C通信方向
 */
typedef enum
{
    Hsi2cMasterWriteSlaveRead = 0x0u, /*!< 主机写从机读 */
    Hsi2cMasterReadSlaveWrite = 0x1u, /*!< 主机读从机写 */
} en_hsi2c_dir_t;

/**
 * @brief HSI2C主机配置寄存器MCFGR1结构体定义
 */
typedef struct
{
    /* MCFGR1 */
    uint32_t u32MatchConfig;          /*!< Match configuration @ref HSI2C_Master_Config1_MATCFG */
    uint32_t u32ReceiveDataMatchOnly; /*!< Receive data match only @ref HSI2C_Master_Config1_RDMO */
    uint32_t u32TimeoutConfig;        /*!< Timeout config for pin low @ref HSI2C_Master_Config1_TIMECFG */
    uint32_t u32IgnoreNack;           /*!< Whether to ignore ACK/NACK @ref HSI2C_Master_Config1_IGNACK */
    uint32_t u32AutoStop;             /*!< Whether to enable auto stop @ref HSI2C_Master_Config1_AUTOSTOP*/
} stc_hsi2c_master_config1_t;

/**
 * @brief HSI2C主机配置寄存器MCFGR2结构体定义
 */
typedef struct
{
    /* MCFGR2 */
    uint32_t u32SdaFilterEnable;       /*!< Analog filter SDA bypass @ref HSI2C_Master_Config2_FILTBPSDA */
    uint32_t u32SclFilterEnable;       /*!< Analog filter SCL bypass @ref HSI2C_Master_Config2_FILTBPSCL */
    uint32_t u32SdaGlitchFilterConfig; /*!< Configures the I2C master digital glitch filters for SDA input. Set to 0 to disable. 数据范围：0 ~ 0xF */
    uint32_t u32SclGlitchFilterConfig; /*!< Configures the I2C master digital glitch filters for SCL input. Set to 0 to disable. 数据范围：0 ~ 0xF */
    uint32_t u32BusIdleTimeout;        /*!< Configures the bus idle timeout period in clock cycles. Set to 0 to disable. 数据范围：0 ~ 0xFFF */
} stc_hsi2c_master_config2_t;

/**
 * @brief HSI2C主机配置寄存器MCFGR3结构体定义
 */
typedef struct
{
    /* MCFGR3 */
    uint32_t u32PinLowTimeout; /*!< Configures the pin low timeout flag in clock cycles. Set to 0 to disable. 数据范围：0 ~ 0xFFF */
} stc_hsi2c_master_config3_t;

/**
 * @brief HSI2C主机配置结构体定义
 */
typedef struct
{
    boolean_t                  bResetBeforeInit; /*!< Whether to reset hsi2c before configure it @ref boolean_t */
    uint32_t                   u32EnableDebug;   /*!< Enable transfers to continue when halted in debug mode @ref HSI2C_Master_Debug_Select */
    uint32_t                   u32BaudRateHz;    /*!< Desired baud rate in Hz */
    uint8_t                    u8SlaveAddr;      /*!< The 10-bit or 7-bit slave address */
    en_hsi2c_dir_t             enDir;            /*!< Direction setting @ref en_hsi2c_dir_t */
    stc_hsi2c_master_config1_t stcMasterConfig1; /*!< Master MCFGR1 configuration @ref stc_hsi2c_master_config1_t */
    stc_hsi2c_master_config2_t stcMasterConfig2; /*!< Master MCFGR2 configuration @ref stc_hsi2c_master_config2_t */
    stc_hsi2c_master_config3_t stcMasterConfig3; /*!< Master MCFGR3 configuration @ref stc_hsi2c_master_config3_t */
    struct
    {
        union /*!< Sub address. MSB transmit first */
        {
            uint32_t u32SubAddr;
            uint8_t  u8SubAddr[4];
        };
        uint8_t u8SubAddrSize; /*!< Length of sub address. Max size is 4 bytes */
    };
} stc_hsi2c_master_init_t;

/**
 * @brief HSI2C从机控制寄存器SCR1结构体定义
 */
typedef struct
{
    /* SCR1 */
    uint32_t u32FuncSelect;          /*!< Function select @ref HSI2C_Slave_Scr1_Func_Select */
    uint32_t u32ConfigAddrMatchMode; /*!< Configure address match mode@ref HSI2C_Slave_Scr1_Addr_Match_Mode */
} stc_hsi2c_slave_control1_t;

/**
 * @brief HSI2C从机控制寄存器SCR2结构体定义
 */
typedef struct
{
    /* SCR2 */
    uint32_t u32FilterEnable;         /*!< Filter enable @ref HSI2C_Slave_Filter_Enable */
    uint32_t u32SdaGlitchFilterWidth; /*!< Width in nanoseconds of the digital filter on the SDA signal. Set to 0 to disable. 数据范围：0 ~ 0xF */
    uint32_t u32SclGlitchFilterWidth; /*!< Width in nanoseconds of the digital filter on the SCL signal. Set to 0 to disable. 数据范围：0 ~ 0xF */
    uint32_t u32TimingDataValidDelay; /*!< Width in nanoseconds of the data valid delay. 数据范围：0 ~ 0x3F */
    uint32_t u32TimingClockHoldTime;  /*!< Width in nanoseconds of the clock hold time.  数据范围：0 ~ 0xF */
} stc_hsi2c_slave_control2_t;

/**
 * @brief HSI2C从机配置结构体定义
 */
typedef struct
{
    boolean_t                  bResetBeforeInit; /*!< Enable reset hsi2c before init it @ref boolean_t */
    stc_hsi2c_slave_control1_t stcSlaveConfig1;  /*!< Slave SCR1 configuration @ref stc_hsi2c_slave_control1_t */
    stc_hsi2c_slave_control2_t stcSlaveConfig2;  /*!< Slave SCR2 configuration @ref stc_hsi2c_slave_control2_t */
    uint32_t                   u32SlaveAddr0;    /*!< The 10-bit or 7-bit slave address0 */
    uint32_t                   u32SlaveAddr1;    /*!< The 10-bit or 7-bit slave address1 */
    en_hsi2c_dir_t             enDir;            /*!< Direction setting @ref en_hsi2c_dir_t */
    uint8_t                    u8SubAddrSize;    /*!< Length of sub address to receive in bytes. Maximum size is 4 bytes */
} stc_hsi2c_slave_init_t;

/**
 * @brief HSI2C通信状态
 */
typedef enum
{
    Hsi2cComBusy = 0x1u,
    Hsi2cComIdle = 0x0u,
} en_hsi2c_com_status_t;

/**
 * @brief HSI2C通信结果
 */
typedef enum
{
    Hsi2cComSuccess              = 0x0u, /* The operation is successful */
    Hsi2cComErrorNack            = 0x1u, /* The slave device sent a NACK in response to a byte */
    Hsi2cComErrorBitError        = 0x2u, /* Transferred bit was not seen on the bus */
    Hsi2cComErrorArbitrationLost = 0x3u, /* Arbitration lost error */
    Hsi2cComErrorPinLowTimeout   = 0x4u, /* SCL or SDA were held low longer than the timeout */
    Hsi2cComErrorBufError        = 0x5u, /* Buffer error */
    Hsi2cComErrorTimeout         = 0x6u, /* Timeout polling status flags */
    Hsi2cComErrorInvalidPara     = 0x7u, /* Invalid parameter */
} en_hsi2c_com_error_t;

/**
 * @brief HSI2C通信配置结构体定义
 */
typedef struct
{
    HSI2C_TypeDef             *HSI2CxBaseAddr; /*!< HSI2C base address */
    uint32_t                   u32Len;         /*!< HSI2C communication data length */
    uint8_t                   *pu8Buf;         /*!< HSI2C communication data buffer pointer */
    __IO uint32_t              u32DataIndex;   /*!< HSI2C communication data transfer index */
    __IO en_hsi2c_com_status_t enComStatus;    /*!< HSI2C communication status */
    uint32_t                   u32RxSize;      /*!< Master: HSI2C receive data length */
                                               /*!< Slave:  HSI2C sub address length */
    struct
    {
        union /*!< Sub address. Receive MSB first */
        {
            uint32_t u32SubAddr;
            uint8_t  u8SubAddr[4];
        };
    };
} stc_hsi2c_com_t;

/**
 * @brief HSI2C状态机定义
 */
typedef enum
{
    Hsi2cStatusStart     = 0x0u, /*!< HSI2C status machine: start/restart */
    Hsi2cStatusSubAddr   = 0x1u, /*!< HSI2C status machine: sub address */
    Hsi2cStatusTransData = 0x2u, /*!< HSI2C status machine: data transfer */
    Hsi2cStatusRxCmd     = 0x3u, /*!< HSI2C status machine: receive command */
    Hsi2cStatusStop      = 0x4u, /*!< HSI2C status machine: stop */
    Hsi2cStatusWaitEnd   = 0x5u, /*!< HSI2C status machine: wait for end */
    Hsi2cStatusRestart   = 0x6u, /*!< HSI2C status machine: reset */
} en_hsi2c_status_machine_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup HSI2C_Global_Macros HSI2C全局宏定义
 * @{
 */

/**
 * @defgroup HSI2C_Master_Cmd HSI2C主机命令选择
 * @{
 */
#define HSI2C_CMD_TX_DATA       (0x0u)                       /*!< Transmit DATA[7:0] */
#define HSI2C_CMD_RX_DATA       (0x1u << HSI2C_MTDR_CMD_Pos) /*!< Receive (DATA[7:0] + 1) bytes */
#define HSI2C_CMD_STOP          (0x2u << HSI2C_MTDR_CMD_Pos) /*!< Generate STOP condition */
#define HSI2C_CMD_RX_DISCARD    (0x3u << HSI2C_MTDR_CMD_Pos) /*!< Receive and discard (DATA[7:0] + 1) bytes */
#define HSI2C_CMD_START_TX_DATA (0x4u << HSI2C_MTDR_CMD_Pos) /*!< Generate (repeated) START and transmit address in DATA[7:0] */
#define HSI2C_CMD_START_TX_DATA_NACK \
    (0x5u << HSI2C_MTDR_CMD_Pos) /*!< Generate (repeated) START and transmit address in DATA[7:0]. This transfer expects a NACK to be returned */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Flag HSI2C主机状态选择
 * @{
 */
#define HSI2C_MASTER_FLAG_BBF  (HSI2C_MSR_BBF_Msk)  /*!< Bus busy flag 注：该位可获取不可清除 */
#define HSI2C_MASTER_FLAG_MBF  (HSI2C_MSR_MBF_Msk)  /*!< Master busy flag 注：该位可获取不可清除 */
#define HSI2C_MASTER_FLAG_DMF  (HSI2C_MSR_DMF_Msk)  /*!< Data match flag */
#define HSI2C_MASTER_FLAG_PLTF (HSI2C_MSR_PLTF_Msk) /*!< Pin low timeout flag */
#define HSI2C_MASTER_FLAG_FEF  (HSI2C_MSR_FEF_Msk)  /*!< Buffer error flag */
#define HSI2C_MASTER_FLAG_ALF  (HSI2C_MSR_ALF_Msk)  /*!< Arbitration lost flag */
#define HSI2C_MASTER_FLAG_NDF  (HSI2C_MSR_NDF_Msk)  /*!< NACK detect flag */
#define HSI2C_MASTER_FLAG_SDF  (HSI2C_MSR_SDF_Msk)  /*!< STOP detect flag */
#define HSI2C_MASTER_FLAG_EPF  (HSI2C_MSR_EPF_Msk)  /*!< End packet flag */
#define HSI2C_MASTER_FLAG_RDF  (HSI2C_MSR_RDF_Msk)  /*!< Receive data flag 注：该位可获取不可清除 */
#define HSI2C_MASTER_FLAG_TDF  (HSI2C_MSR_TDF_Msk)  /*!< Transmit data flag 注：该位可获取不可清除 */

