ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_hsi2c.h
#define HSI2C_MASTER_FLAG_CLR_ALL \
    (HSI2C_MASTER_FLAG_DMF | HSI2C_MASTER_FLAG_PLTF | HSI2C_MASTER_FLAG_FEF | HSI2C_MASTER_FLAG_ALF | HSI2C_MASTER_FLAG_NDF | HSI2C_MASTER_FLAG_SDF \
     | HSI2C_MASTER_FLAG_EPF) /*!< 所有清除标志位 */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Slave_Flag HSI2C从机状态选择
 * @{
 */
#define HSI2C_SLAVE_FLAG_BBF     (HSI2C_SSR_BBF_Msk)  /*!< Bus busy flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_SBF     (HSI2C_SSR_SBF_Msk)  /*!< Slave busy flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_SARF    (HSI2C_SSR_SARF_Msk) /*!< SMBus alert Response flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_GCF     (HSI2C_SSR_GCF_Msk)  /*!< General call flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_AM1F    (HSI2C_SSR_AM1F_Msk) /*!< Address match 1 flag　注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_AM0F    (HSI2C_SSR_AM0F_Msk) /*!< Address match 0 flag　注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_FEF     (HSI2C_SSR_FEF_Msk)  /*!< Buffer Eerror flag */
#define HSI2C_SLAVE_FLAG_BEF     (HSI2C_SSR_BEF_Msk)  /*!< Bit error flag */
#define HSI2C_SLAVE_FLAG_SDF     (HSI2C_SSR_SDF_Msk)  /*!< STOP detect flag */
#define HSI2C_SLAVE_FLAG_RSF     (HSI2C_SSR_RSF_Msk)  /*!< Repeated start flag */
#define HSI2C_SLAVE_FLAG_TAF     (HSI2C_SSR_TAF_Msk)  /*!< Transmit ACK flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_AVF     (HSI2C_SSR_AVF_Msk)  /*!< Address valid flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_RDF     (HSI2C_SSR_RDF_Msk)  /*!< Receive data flag 注：该位可获取不可清除 */
#define HSI2C_SLAVE_FLAG_TDF     (HSI2C_SSR_TDF_Msk)  /*!< Transmit data flag 注：该位可获取不可清除 */

#define HSI2C_SLAVE_FLAG_CLR_ALL (HSI2C_SLAVE_FLAG_FEF | HSI2C_SLAVE_FLAG_BEF | HSI2C_SLAVE_FLAG_SDF | HSI2C_SLAVE_FLAG_RSF) /*!< 所有清除标志位 */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Int HSI2C主机中断选择
 * @{
 */
#define HSI2C_MASTER_INT_DMIE  (HSI2C_MIER_DMIE_Msk)  /*!< Data match interrupt enable */
#define HSI2C_MASTER_INT_PLTIE (HSI2C_MIER_PLTIE_Msk) /*!< Pin low timeout interrupt enable */
#define HSI2C_MASTER_INT_FEIE  (HSI2C_MIER_FEIE_Msk)  /*!< FIFO error interrupt enable */
#define HSI2C_MASTER_INT_ALIE  (HSI2C_MIER_ALIE_Msk)  /*!< Arbitration lost interrupt enable */
#define HSI2C_MASTER_INT_NDIE  (HSI2C_MIER_NDIE_Msk)  /*!< NACK detect interrupt enable */
#define HSI2C_MASTER_INT_SDIE  (HSI2C_MIER_SDIE_Msk)  /*!< Stop detect interrupt enable */
#define HSI2C_MASTER_INT_EPIE  (HSI2C_MIER_EPIE_Msk)  /*!< End packet interrupt enable */
#define HSI2C_MASTER_INT_RDIE  (HSI2C_MIER_RDIE_Msk)  /*!< Receive data interrupt enable */
#define HSI2C_MASTER_INT_TDIE  (HSI2C_MIER_TDIE_Msk)  /*!< Transmit data interrupt enable */

#define HSI2C_MASTER_INT_ALL \
    (HSI2C_MIER_DMIE_Msk | HSI2C_MIER_PLTIE_Msk | HSI2C_MIER_FEIE_Msk | HSI2C_MIER_ALIE_Msk | HSI2C_MIER_NDIE_Msk | HSI2C_MIER_SDIE_Msk | HSI2C_MIER_EPIE_Msk \
     | HSI2C_MIER_RDIE_Msk | HSI2C_MIER_TDIE_Msk) /*!< All interrupt enable */

/**
 * @}
 */

/**
 * @defgroup HSI2C_Slave_Int HSI2C从机中断选择
 * @{
 */
#define HSI2C_SLAVE_INT_SARIE (HSI2C_SIER_SARIE_Msk) /*!< SMBus alert response interrupt enable */
#define HSI2C_SLAVE_INT_GCIE  (HSI2C_SIER_GCIE_Msk)  /*!< General call interrupt enable */
#define HSI2C_SLAVE_INT_AM1IE (HSI2C_SIER_AM1IE_Msk) /*!< Address match 1 interrupt enable */
#define HSI2C_SLAVE_INT_AM0IE (HSI2C_SIER_AM0IE_Msk) /*!< Address match 0 interrupt enable */
#define HSI2C_SLAVE_INT_FEIE  (HSI2C_SIER_FEIE_Msk)  /*!< Buffer error interrupt enable */
#define HSI2C_SLAVE_INT_BEIE  (HSI2C_SIER_BEIE_Msk)  /*!< Bit error interrupt enable */
#define HSI2C_SLAVE_INT_SDIE  (HSI2C_SIER_SDIE_Msk)  /*!< STOP detect interrupt enable */
#define HSI2C_SLAVE_INT_RSIE  (HSI2C_SIER_RSIE_Msk)  /*!< Repeated start interrupt enable */
#define HSI2C_SLAVE_INT_TAIE  (HSI2C_SIER_TAIE_Msk)  /*!< Transmit ACK interrupt enable */
#define HSI2C_SLAVE_INT_AVIE  (HSI2C_SIER_AVIE_Msk)  /*!< Address valid interrupt enable*/
#define HSI2C_SLAVE_INT_RDIE  (HSI2C_SIER_RDIE_Msk)  /*!< Receive data interrupt enable */
#define HSI2C_SLAVE_INT_TDIE  (HSI2C_SIER_TDIE_Msk)  /*!< Transmit data interrupt enable */

#define HSI2C_SLAVE_INT_ALL \
    (HSI2C_SIER_SARIE_Msk | HSI2C_SIER_GCIE_Msk | HSI2C_SIER_AM1IE_Msk | HSI2C_SIER_AM0IE_Msk | HSI2C_SIER_FEIE_Msk | HSI2C_SIER_BEIE_Msk \
     | HSI2C_SIER_SDIE_Msk | HSI2C_SIER_RSIE_Msk | HSI2C_SIER_TAIE_Msk | HSI2C_SIER_AVIE_Msk | HSI2C_SIER_RDIE_Msk \
     | HSI2C_SIER_TDIE_Msk) /*!< All interrupt enable */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Debug_Select HSI2C调试使能选择
 * @{
 */
#define HSI2C_MASTER_DEBUG_OFF (0x0u)                /*!< Debug off */
#define HSI2C_MASTER_DEBUG_ON  (HSI2C_MCR_DBGEN_Msk) /*!< Debug on */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config1_MATCFG HSI2C主机匹配配置
 * @{
 */
#define HSI2C_MASTER_MATCFG_DISABLE  (0x0u)                            /*!< Match is disabled */
#define HSI2C_MASTER_MATCFG_ENABLE_2 (0x2u << HSI2C_MCFGR1_MATCFG_Pos) /*!< Match is enabled */
                                                                       /*!< 1st data word equals MDMR.MATCH0 OR MDMR.MATCH1) */
#define HSI2C_MASTER_MATCFG_ENABLE_3 (0x3u << HSI2C_MCFGR1_MATCFG_Pos) /*!< Match is enabled */
                                                                       /*!< Any data word equals MDMR.MATCH0 OR MDMR.MATCH1) */
#define HSI2C_MASTER_MATCFG_ENABLE_4 (0x4u << HSI2C_MCFGR1_MATCFG_Pos) /*!< Match is enabled */
                                                                       /*!< 1st data word equals MDMR.MATCH0 AND 2nd data word equals MDMR.MATCH1 */
#define HSI2C_MASTER_MATCFG_ENABLE_5 (0x5u << HSI2C_MCFGR1_MATCFG_Pos) /*!< Match is enabled */
                                                                       /*!< Any data word equals MDMR.MATCH0 AND next data word equals MDMR.MATCH1) */
#define HSI2C_MASTER_MATCFG_ENABLE_6 (0x6u << HSI2C_MCFGR1_MATCFG_Pos) /*!< Match is enabled */
                                                                       /*!< 1st data word AND MDMR.MATCH1 equals MDMR.MATCH0 AND MDMR.MATCH1) */
#define HSI2C_MASTER_MATCFG_ENABLE_7 (0x7u << HSI2C_MCFGR1_MATCFG_Pos) /*!< Match is enabled */
                                                                       /*!< Any data word AND MDMR.MATCH1 equals MDMR.MATCH0 AND MDMR.MATCH1) */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config1_RDMO HSI2C主机仅接收数据匹配配置
 * @{
 */
#define HSI2C_MASTER_RDMO_STORE   (0x0u)                  /*!< Received data is stored in the receive buffer */
#define HSI2C_MASTER_RDMO_DISCARD (HSI2C_MCFGR1_RDMO_Msk) /*!< Received data is discarded unless the the Data Match Flag (MSR.DMF) is set */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config1_TIMECFG HSI2C主机超时配置
 * @{
 */
#define HSI2C_MASTER_TIMECFG_SCL     (0x0u)                     /*!< MSR.PLTF sets if SCL is low for longer than the configured timeout */
#define HSI2C_MASTER_TIMECFG_SCL_SDA (HSI2C_MCFGR1_TIMECFG_Msk) /*!< MSR.PLTF sets if either SCL or SDA is low for longer than the configured timeout */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config1_IGNACK HSI2C主机NACK配置
 * @{
 */
#define HSI2C_MASTER_IGNACK_NORMAL      (0x0u)                    /*!< I2C Master receives ACK and NACK normally */
#define HSI2C_MASTER_IGNACK_IGNORE_NACK (HSI2C_MCFGR1_IGNACK_Msk) /*!< I2C Master treats a received NACK as if it (NACK) was an ACK */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config1_AUTOSTOP HSI2C主机自动产生STOP配置
 * @{
 */
#define HSI2C_MASTER_AUTOSTOP_DISABLE (0x0u)                      /*!< No effect */
#define HSI2C_MASTER_AUTOSTOP_ENABLE  (HSI2C_MCFGR1_AUTOSTOP_Msk) /*!< STOP condition is automatically generated */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config2_FILTBPSDA HSI2C主机SDA bypass配置
 * @{
 */
#define HSI2C_MASTER_FILTBPSDA_DISABLE (0x0u)                       /*!< SDA pass the analog filter */
#define HSI2C_MASTER_FILTBPSDA_ENABLE  (HSI2C_MCFGR2_FILTBPSDA_Msk) /*!< SDA bypass the analog filter */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Master_Config2_FILTBPSCL HSI2C主机SCL bypass配置
 * @{
 */
#define HSI2C_MASTER_FILTBPSCL_DISABLE (0x0u)                       /*!< SCL pass the analog filter */
#define HSI2C_MASTER_FILTBPSCL_ENABLE  (HSI2C_MCFGR2_FILTBPSCL_Msk) /*!< SCL bypass the analog filter */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Slave_Scr1_Addr_Match_Mode HSI2C从机SCR1地址配置模式
 * @{
 */
#define HSI2C_SLAVE_ADDR0_7B               (0x0u)                            /*!< Address match 0 (7-bit) */
#define HSI2C_SLAVE_ADDR0_10B              (0x1u << HSI2C_SCR1_ADDRMODE_Pos) /*!< Address match 0 (10-bit) */
#define HSI2C_SLAVE_ADDR0_7B_OR_ADDR1_7B   (0x2u << HSI2C_SCR1_ADDRMODE_Pos) /*!< Address match 0 (7-bit) or Address match 1 (7-bit) */
#define HSI2C_SLAVE_ADDR0_10B_OR_ADDR1_10B (0x3u << HSI2C_SCR1_ADDRMODE_Pos) /*!< Address match 0 (10-bit) or Address match 1 (10-bit) */
#define HSI2C_SLAVE_ADDR0_7B_OR_ADDR1_10B  (0x4u << HSI2C_SCR1_ADDRMODE_Pos) /*!< Address match 0 (7-bit) or Address match 1 (10-bit) */
#define HSI2C_SLAVE_ADDR0_10B_OR_ADDR1_7B  (0x5u << HSI2C_SCR1_ADDRMODE_Pos) /*!< Address match 0 (10-bit) or Address match 1 (7-bit) */
#define HSI2C_SLAVE_ADDR0_7B_TO_ADDR1_7B   (0x6u << HSI2C_SCR1_ADDRMODE_Pos) /*!< From Address match 0 (7-bit) to Address match 1 (7-bit) */
#define HSI2C_SLAVE_ADDR0_10B_TO_ADDR1_10B (0x7u << HSI2C_SCR1_ADDRMODE_Pos) /*!< From Address match 0 (10-bit) to Address match 1 (10-bit) */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Slave_Scr1_Func_Select HSI2C从机SCR1功能选择
 * @{
 */
#define HSI2C_SLAVE_ADRSTALL_ENABLE (HSI2C_SCR1_ADRSTALL_Msk) /*!< Address SCL stall */
#define HSI2C_SLAVE_RXSTALL_ENABLE  (HSI2C_SCR1_RXSTALL_Msk)  /*!< RX SCL stall */
#define HSI2C_SLAVE_TXDSTALL_ENABLE (HSI2C_SCR1_TXDSTALL_Msk) /*!< TX data SCL stall */
#define HSI2C_SLAVE_ACKSTALL_ENABLE (HSI2C_SCR1_ACKSTALL_Msk) /*!< ACK SCL stall */
#define HSI2C_SLAVE_GCEN_ENABLE     (HSI2C_SCR1_GCEN_Msk)     /*!< General call enable */
#define HSI2C_SLAVE_SAEN_ENABLE     (HSI2C_SCR1_SAEN_Msk)     /*!< SMBus alert enable  */
#define HSI2C_SLAVE_TXCFG_ENABLE    (HSI2C_SCR1_TXCFG_Msk)    /*!< Transmit flag configuration */
#define HSI2C_SLAVE_RXCFG_ENABLE    (HSI2C_SCR1_RXCFG_Msk)    /*!< Receive data configuration */
#define HSI2C_SLAVE_IGNACK_ENABLE   (HSI2C_SCR1_IGNACK_Msk)   /*!< Ignore NACK */
#define HSI2C_SLAVE_HSMEN_ENABLE    (HSI2C_SCR1_HSMEN_Msk)    /*!< High speed mode enable */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Slave_Filter_Enable HSI2C从机控制寄存器SCR2 Glitch Filter使能选择
 * @{
 */
#define HSI2C_SLAVE_FILTER_OFF (0x0u)                  /*!< Glitch filter off */
#define HSI2C_SLAVE_FILTER_ON  (HSI2C_SCR2_FILTEN_Msk) /*!< Glitch filter on */
/**
 * @}
 */

/**
 * @defgroup HSI2C_Slave_Transfer_Ack_Nack HSI2C从机发送ACK/NACK
 * @{
 */
#define HSI2C_SLAVE_TX_ACK  (0x0u)                  /*!< Write a transmit ACK for each received word */
#define HSI2C_SLAVE_TX_NACK (HSI2C_STAR_TXNACK_Msk) /*!< Write a transmit NACK for each received word */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/
/**
 * @addtogroup HSI2C_Global_Variables HSI2C全局变量定义
 * @{
 */
extern stc_hsi2c_com_t           stcHsi2cCom;
extern en_hsi2c_status_machine_t enMasterStatusMachine;
extern stc_hsi2c_master_init_t   stcHsi2cMasterInit;
extern stc_hsi2c_slave_init_t    stcHsi2cSlaveInit;
/**
 * @}
 */
/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup HSI2C_Global_Functions HSI2C全局函数定义
 * @{
 */
en_result_t HSI2C_MasterInit(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_master_init_t *pstcHsi2cInit, uint32_t u32SrcClockHz);              /* 主机初始化 */
en_result_t HSI2C_MasterBaudRateSet(HSI2C_TypeDef *HSI2Cx, const stc_hsi2c_master_init_t *pstcHsi2cInit, uint32_t u32SrcClockHz); /* 主机波特率设置 */
en_result_t HSI2C_MasterTransferInt(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data, uint32_t u32Size);                                   /* 主机中断传输设置 */
en_result_t HSI2C_MasterTransferPoll(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data, uint32_t u32Size, uint32_t u32Timeout);             /* 主机轮询传输 */

void        HSI2C_SlaveInit(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_slave_init_t *pstcHsi2cInit, uint32_t u32SrcClockHz);   /* 从机初始化 */
en_result_t HSI2C_SlaveTransferInt(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data, uint32_t u32Size);                       /* 从机中断传输设置 */
en_result_t HSI2C_SlaveTransferPoll(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data, uint32_t u32Size, uint32_t u32Timeout); /* 从机轮询传输 */

void HSI2C_MasterMcfgr1Config(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_master_config1_t *pstcHsi2cConfig); /* 主机配置寄存器1设置(MCFGR1寄存器设置) */
void HSI2C_MasterMcfgr2Config(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_master_config2_t *pstcHsi2cConfig); /* 主机配置寄存器2设置(MCFGR2寄存器设置) */
void HSI2C_MasterMcfgr3Config(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_master_config3_t *pstcHsi2cConfig); /* 主机配置寄存器3设置(MCFGR3寄存器设置) */
void HSI2C_MasterDataMatchConfig(HSI2C_TypeDef *HSI2Cx, uint32_t u32MatchValue0, uint32_t u32MatchValue1); /* 主机数据配置设置(MDMR寄存器设置) */

void HSI2C_SlaveScr1Config(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_slave_control1_t *pstcHsi2cConfig); /* 从机SCR1寄存器设置 */
void HSI2C_SlaveScr2Config(HSI2C_TypeDef *HSI2Cx, stc_hsi2c_slave_control2_t *pstcHsi2cConfig); /* 从机SCR2寄存器设置 */

