ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_hsi2c.h
void HSI2C_MasterReset(HSI2C_TypeDef *HSI2Cx); /* 主机软件复位 */
void HSI2C_SlaveReset(HSI2C_TypeDef *HSI2Cx);  /* 从机软件复位 */

void HSI2C_MasterEnable(HSI2C_TypeDef *HSI2Cx);  /* 主机使能 */
void HSI2C_SlaveEnable(HSI2C_TypeDef *HSI2Cx);   /* 从机使能 */
void HSI2C_MasterDisable(HSI2C_TypeDef *HSI2Cx); /* 主机禁止 */
void HSI2C_SlaveDisable(HSI2C_TypeDef *HSI2Cx);  /* 从机禁止 */

boolean_t HSI2C_MasterFlagGet(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cFlag);   /* 主机标志位获取 */
boolean_t HSI2C_SlaveFlagGet(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cFlag);    /* 从机标志位获取 */
void      HSI2C_MasterFlagClear(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cFlag); /* 主机标志位清除 */
void      HSI2C_SlaveFlagClear(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cFlag);  /* 从机标志位清除 */

void     HSI2C_MasterIntEnable(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cInt);  /* 主机中断允许 */
void     HSI2C_MasterIntDisable(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cInt); /* 主机中断禁止 */
void     HSI2C_SlaveIntEnable(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cInt);   /* 从机中断使能 */
void     HSI2C_SlaveIntDisable(HSI2C_TypeDef *HSI2Cx, uint32_t u32Hsi2cInt);  /* 从机中断禁止 */
uint32_t HSI2C_MasterIntGet(HSI2C_TypeDef *HSI2Cx);                           /* 主机中断使能获取 */
uint32_t HSI2C_SlaveIntGet(HSI2C_TypeDef *HSI2Cx);                            /* 从机中断使能获取 */

void                 HSI2C_MasterStart(HSI2C_TypeDef *HSI2Cx, uint8_t u8SlaveAddr, en_hsi2c_dir_t enTransDir); /* 主机Start命令 */
void                 HSI2C_MasterStop(HSI2C_TypeDef *HSI2Cx);                                                  /* 主机Stop命令 */
void                 HSI2C_MasterWriteData(HSI2C_TypeDef *HSI2Cx, uint8_t u8Data);                             /* 主机写数据 */
void                 HSI2C_MasterReceiveCmd(HSI2C_TypeDef *HSI2Cx, uint8_t u8Len);                             /* 主机读数据命令 */
en_result_t          HSI2C_MasterReadData(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data);                            /* 主机读数据 */
en_hsi2c_com_error_t HSI2C_MasterErrorGet(uint32_t u32MasterFlag);                                             /* 主机传输Error类型输出 */
void                 HSI2C_MasterTransAbort(HSI2C_TypeDef *HSI2Cx);                                            /* 主机传输终止 */

void                 HSI2C_SlaveWriteAddr(HSI2C_TypeDef *HSI2Cx, uint16_t u16Addr0, uint16_t u16Addr1); /* 从机写地址 */
void                 HSI2C_SlaveWriteData(HSI2C_TypeDef *HSI2Cx, uint8_t u8Data);                       /* 从机写数据 */
en_result_t          HSI2C_SlaveReadData(HSI2C_TypeDef *HSI2Cx, uint8_t *pu8Data);                      /* 从机读数据 */
en_result_t          HSI2C_SlaveReadAddr(HSI2C_TypeDef *HSI2Cx, uint16_t *pu16Data);                    /* 从机读接收的地址 */
en_hsi2c_com_error_t HSI2C_SlaveErrorGet(uint32_t u32SlaveFlag);                                        /* 从机传输Error类型输出 */
void                 HSI2C_SlaveTransAbort(HSI2C_TypeDef *HSI2Cx);                                      /* 从机传输终止 */
void                 HSI2C_SlaveTransNack(HSI2C_TypeDef *HSI2Cx, uint32_t u32AckNack);                  /* 从机发送ACK/NACK */

void HSI2C_MasterStatusMachineStart(void);                /* 主机状态机控制（Start） */
void HSI2C_MasterStatusMachineSubAddr(void);              /* 主机状态机控制（Sub address） */
void HSI2C_MasterStatusMachineRestart(void);              /* 主机状态机控制（Restart） */
void HSI2C_MasterStatusMachineStop(void);                 /* 主机状态机控制（Stop） */
void HSI2C_MasterStatusMachineTrans(void);                /* 主机状态机控制（Data transfer） */
void HSI2C_MasterStatusMachineRxCmd(uint32_t *pu32RxLen); /* 主机状态机控制（Receive command） */

uint8_t HSI2C_10BitAddrMdHighBitsGet(uint16_t u16AddrData); /* 10位地址模式获取高字节 */
uint8_t HSI2C_10BitAddrMdLowBitsGet(uint16_t u16AddrData);  /* 10位地址模式获取低字节 */

void HSI2C_MasterStcInit(stc_hsi2c_master_init_t *pstcInit); /* 主机结构体初始化 */
void HSI2C_SlaveStcInit(stc_hsi2c_slave_init_t *pstcInit);   /* 从机结构体初始化 */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HSI2C_H__ */
/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
